

<a href='https://huntsman.usu.edu/directory/jahangiry-pedram'> <img src="logo.jpg" /></a>

___
## Pedram Jahangiry 

# Introduction to Pandas

Topics to be covered:

1. Series
2. DataFrames
3. Missing Variables
4. Operations
5. Data import and export

Make sure you have access to the pandas cheatsheet provided in the course folder.

## 1. Series

Series are very similar to NumPy arrays. The difference is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location. We can convert a list,numpy array, or dictionary to a Series.

In [1]:
import numpy as np
import pandas as pd

In [2]:
my_list = [1,2,3]
my_list

[1, 2, 3]

In [3]:
pd.Series(data=my_list)

0    1
1    2
2    3
dtype: int64

In [4]:
labels = ['a','b','c']
pd.Series(data=my_list,index=labels)

a    1
b    2
c    3
dtype: int64

In [5]:
my_array = np.array([1,2,3])
pd.Series(my_array)

0    1
1    2
2    3
dtype: int32

In [6]:
pd.Series(my_array,labels)

a    1
b    2
c    3
dtype: int32

In [7]:
my_dict = {'a':1,'b':2,'c':3}
pd.Series(my_dict)

a    1
b    2
c    3
dtype: int64

In [8]:
my_series = pd.Series(my_dict)
my_series

a    1
b    2
c    3
dtype: int64

In [9]:
my_series[0]         # unlike dictionaries, we can extract info by index number and label.

1

In [10]:
my_series['a']

1

## 2. DataFrames

DataFrames are directly inspired by the R programming language and are the workhorse of pandas.

In [11]:
np.random.seed(100)  # do this if you want to see the same results as mine

In [12]:
df = pd.DataFrame(data= np.random.randn(4,4),index='A B C D'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411

In [13]:
df.describe()

              W         X         Y         Z
count  4.000000  4.000000  4.000000  4.000000
mean  -0.385384  0.482187  0.397227 -0.247932
std    1.126511  0.247722  0.685467  0.622657
min   -1.749765  0.255001 -0.458027 -1.070043
25%   -0.875138  0.320761  0.051378 -0.456838
50%   -0.386545  0.428450  0.446950 -0.178424
75%    0.103208  0.589876  0.792800  0.030483
max    0.981321  0.816847  1.153036  0.435163

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, A to D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       4 non-null      float64
 1   X       4 non-null      float64
 2   Y       4 non-null      float64
 3   Z       4 non-null      float64
dtypes: float64(4)
memory usage: 160.0+ bytes

In [15]:
df.describe().transpose()              # or equivalently, df.describe().T

   count      mean       std       min       25%       50%       75%       max
W    4.0 -0.385384  1.126511 -1.749765 -0.875138 -0.386545  0.103208  0.981321
X    4.0  0.482187  0.247722  0.255001  0.320761  0.428450  0.589876  0.816847
Y    4.0  0.397227  0.685467 -0.458027  0.051378  0.446950  0.792800  1.153036
Z    4.0 -0.247932  0.622657 -1.070043 -0.456838 -0.178424  0.030483  0.435163

### Indexing and extraction

In [16]:
df

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411

In [17]:
df['W']

A   -1.749765
B    0.981321
C   -0.189496
D   -0.583595
Name: W, dtype: float64

In [18]:
df[['W']]

          W
A -1.749765
B  0.981321
C -0.189496
D -0.583595

In [19]:
df[['W','Y']]

          W         Y
A -1.749765  1.153036
B  0.981321  0.221180
C -0.189496 -0.458027
D -0.583595  0.672721

In [20]:
df['new'] = df['W'] + df['Y']

In [21]:
df

          W         X         Y         Z       new
A -1.749765  0.342680  1.153036 -0.252436 -0.596730
B  0.981321  0.514219  0.221180 -1.070043  1.202500
C -0.189496  0.255001 -0.458027  0.435163 -0.647523
D -0.583595  0.816847  0.672721 -0.104411  0.089126

In [22]:
df.drop('A',axis=0)

          W         X         Y         Z       new
B  0.981321  0.514219  0.221180 -1.070043  1.202500
C -0.189496  0.255001 -0.458027  0.435163 -0.647523
D -0.583595  0.816847  0.672721 -0.104411  0.089126

In [23]:
df.drop('new',axis=1)

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411

In [24]:
df

          W         X         Y         Z       new
A -1.749765  0.342680  1.153036 -0.252436 -0.596730
B  0.981321  0.514219  0.221180 -1.070043  1.202500
C -0.189496  0.255001 -0.458027  0.435163 -0.647523
D -0.583595  0.816847  0.672721 -0.104411  0.089126

In [25]:
df.drop('new',axis=1,inplace=True)    
# or alternatively use: df = df.drop('new', 1)

In [26]:
df

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411

In [27]:
# we can select a row by calling its label or by selecting based on its position instead of label 
df.loc['A']

W   -1.749765
X    0.342680
Y    1.153036
Z   -0.252436
Name: A, dtype: float64

In [28]:
df.iloc[0]

W   -1.749765
X    0.342680
Y    1.153036
Z   -0.252436
Name: A, dtype: float64

In [29]:
df.iloc[np.arange(3)]

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163

In [30]:
df.loc[['A','D'],['W','Z']]

          W         Z
A -1.749765 -0.252436
D -0.583595 -0.104411

### Conditional extraction
This is very similar to numpy array conditional extraction

In [31]:
df

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411

In [32]:
df>0

       W     X      Y      Z
A  False  True   True  False
B   True  True   True  False
C  False  True  False   True
D  False  True   True  False

In [33]:
df[df>0]

          W         X         Y         Z
A       NaN  0.342680  1.153036       NaN
B  0.981321  0.514219  0.221180       NaN
C       NaN  0.255001       NaN  0.435163
D       NaN  0.816847  0.672721       NaN

In [34]:
df[df['Y']>0]

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
D -0.583595  0.816847  0.672721 -0.104411

In [35]:
df[df['Y']>0]['X']

A    0.342680
B    0.514219
D    0.816847
Name: X, dtype: float64

In [36]:
df[df['Y']>0][['Y','Z']]

          Y         Z
A  1.153036 -0.252436
B  0.221180 -1.070043
D  0.672721 -0.104411

In [37]:
df[(df['Y']>0) & (df['Z'] < 0.5)]

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
D -0.583595  0.816847  0.672721 -0.104411

In [38]:
df

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411

In [39]:
df.tail(2)

          W         X         Y         Z
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411

## 3. Missing variables

In [40]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [41]:
df.isnull()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [42]:
df.dropna() # by default axis=0,   # this is similar to df[complete.cases(df),] in R

     A    B  C
0  1.0  5.0  1

In [43]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [44]:
df.fillna('new value')

           A          B  C
0        1.0        5.0  1
1        2.0  new value  2
2  new value  new value  3

In [45]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [46]:
df['A'].mean()

1.5

In [47]:
df['A'].fillna(value=df['A'].mean()) # filling the value with the mean of a column

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64


## 4. Operations

In [48]:
df = pd.DataFrame({'names': 'PJ PJ TJ MJ'.split() ,
                   'GPA': [4,4,3.8,3.5]}, index='A B C D'.split())
df

  names  GPA
A    PJ  4.0
B    PJ  4.0
C    TJ  3.8
D    MJ  3.5

In [49]:
df.head(3)

  names  GPA
A    PJ  4.0
B    PJ  4.0
C    TJ  3.8

In [50]:
df.tail(1)

  names  GPA
D    MJ  3.5

In [51]:
# Unique Values
df['names'].unique()

array(['PJ', 'TJ', 'MJ'], dtype=object)

In [52]:
# number of unique values
df['GPA'].nunique()

3

In [53]:
df['names'].value_counts()     # this is table(df$names) in R

PJ    2
TJ    1
MJ    1
Name: names, dtype: int64

In [54]:
# Applying Functions
df['GPA'].mean()

3.825

In [55]:
round(df['GPA'].std(), 2)

0.24

In [56]:
df['GPA_100'] = df['GPA'].apply(lambda x: x*25)   # of ocurse we are looking for some special functions not just x*25
df

# or alternatively: df['GPA_100']=list(map(lambda x:x*25 , df['GPA']))

  names  GPA  GPA_100
A    PJ  4.0    100.0
B    PJ  4.0    100.0
C    TJ  3.8     95.0
D    MJ  3.5     87.5

In [57]:
df.columns            # names(df) in R

Index(['names', 'GPA', 'GPA_100'], dtype='object')

In [58]:
df.index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [59]:
df.sort_values(by='GPA') #inplace=False by default (what does this mean?)

  names  GPA  GPA_100
D    MJ  3.5     87.5
C    TJ  3.8     95.0
A    PJ  4.0    100.0
B    PJ  4.0    100.0

In [60]:
df.reset_index(inplace=True)

In [61]:
df

  index names  GPA  GPA_100
0     A    PJ  4.0    100.0
1     B    PJ  4.0    100.0
2     C    TJ  3.8     95.0
3     D    MJ  3.5     87.5

In [62]:
df.set_index('index')

      names  GPA  GPA_100
index
A        PJ  4.0    100.0
B        PJ  4.0    100.0
C        TJ  3.8     95.0
D        MJ  3.5     87.5

#### Renaming columns:

In [63]:
df.rename(columns={'GPA_100': 'Normalized GPA'}, inplace=True)

In [64]:
df.head()

  index names  GPA  Normalized GPA
0     A    PJ  4.0           100.0
1     B    PJ  4.0           100.0
2     C    TJ  3.8            95.0
3     D    MJ  3.5            87.5

#### Conditional mutation (creating new variables)
Let's say we want to create a new variable named "is_pass" and is defined as "is_pass"=1 if "GPA">3.6 and 0 otherwise. There are multiple ways to do that:

In [65]:
# let's begin with the hard way!
df['GPA']>3.6

0     True
1     True
2     True
3    False
Name: GPA, dtype: bool

In [67]:
temp=[]
for x in df['GPA']:
    if x>3.6: temp.append('pass') 
    else: temp.append('fail')

df['is_pass']=temp
df

  index names  GPA  Normalized GPA is_pass
0     A    PJ  4.0           100.0    pass
1     B    PJ  4.0           100.0    pass
2     C    TJ  3.8            95.0    pass
3     D    MJ  3.5            87.5    fail

Can we do it in one line? How about using list comprehension?

In [68]:
df['is_pass2'] = ['pass' if x > 3.6 else 'fail' for x in df['GPA']]    
# in R: df <- mutate(df,is_pass = ifelse(GPA>3.5, "pass", "fail"))
df

  index names  GPA  Normalized GPA is_pass is_pass2
0     A    PJ  4.0           100.0    pass     pass
1     B    PJ  4.0           100.0    pass     pass
2     C    TJ  3.8            95.0    pass     pass
3     D    MJ  3.5            87.5    fail     fail

Is there any other way?

In [69]:
df.loc[df['GPA']> 3.6, 'is_pass3'] ='pass'
df.loc[df['GPA']<=3.6, 'is_pass3'] ='fail'
df.head()

  index names  GPA  Normalized GPA is_pass is_pass2 is_pass3
0     A    PJ  4.0           100.0    pass     pass     pass
1     B    PJ  4.0           100.0    pass     pass     pass
2     C    TJ  3.8            95.0    pass     pass     pass
3     D    MJ  3.5            87.5    fail     fail     fail

Is there any other way?

In [71]:
df['is_pass4']=np.where(df['GPA']>3.6, 'pass','fail')
df.head()

  index names  GPA  Normalized GPA is_pass is_pass2 is_pass3 is_pass4
0     A    PJ  4.0           100.0    pass     pass     pass     pass
1     B    PJ  4.0           100.0    pass     pass     pass     pass
2     C    TJ  3.8            95.0    pass     pass     pass     pass
3     D    MJ  3.5            87.5    fail     fail     fail     fail

## 5. Data import and export

In [72]:
# reading from CSV file
df = pd.read_csv('GDP.csv')   # reading excel files: pd.read_excel('GDP.xlsx',sheetname='Sheet1')
df.tail(5)

           DATE        GDP
285  2018-04-01  20510.177
286  2018-07-01  20749.752
287  2018-10-01  20897.804
288  2019-01-01  21098.827
289  2019-04-01  21339.121

In [73]:
# Writing to CSV file
df.to_csv('GDP_new.csv',index=False)

In [74]:
df.to_excel('GDP.xlsx',sheet_name='raw data', index=False)